### 🔧 Bootstrap Terraform Plan

```hcl
time_sleep.wait_for_atlantis_dns: Refreshing state... [id=2025-12-21T19:32:14Z]
local_sensitive_file.ssh_key: Refreshing state... [id=56f841acdce74f5731624b8e9141f696ff71c0b4]
null_resource.k3s_server: Refreshing state... [id=127050603283306056]
null_resource.atlantis_test: Refreshing state... [id=8377427200789139531]
helm_release.platform_pg: Refreshing state... [id=postgresql]
helm_release.atlantis: Refreshing state... [id=atlantis]
cloudflare_record.x_staging: Refreshing state... [id=994d200bafbce9b2e8c0c3d1b4536678]
cloudflare_record.wildcard_public: Refreshing state... [id=ad4c7065dfdc814f8fceb49ebe907ae4]
time_sleep.wait_for_atlantis_https: Refreshing state... [id=2025-12-21T19:33:18Z]
cloudflare_record.root: Refreshing state... [id=6af3d1fa49c3d911892f195a4c7fd6c4]
kubectl_manifest.platform_pg_init: Refreshing state... [id=/apis/batch/v1/namespaces/platform/jobs/platform-pg-init-a3a04d06]
cloudflare_record.infra_records["openpanel"]: Refreshing state... [id=96fe6a95fd7414d551adc36bdd9c3176]
cloudflare_record.infra_records["atlantis"]: Refreshing state... [id=59a2fd7865729841e992e4fffe4ae9e3]
cloudflare_record.infra_records["kdashboard"]: Refreshing state... [id=8ed6a6305893dd0bdead535fd5d45016]
cloudflare_record.infra_records["kcloud"]: Refreshing state... [id=6f06ad93f69bd78245fdfe8a57ddd189]
cloudflare_record.infra_records["sso"]: Refreshing state... [id=70ad91913df52a16ec8902afdb9bb6e1]
cloudflare_record.infra_records["k3s"]: Refreshing state... [id=34540150c83277063b0e8752aabbe4d3]
cloudflare_record.infra_records["kapi"]: Refreshing state... [id=281f5c2bf647990805ca894fc0631038]
cloudflare_record.infra_records["home"]: Refreshing state... [id=b3a26757041f1edd4d855554356d2084]
cloudflare_record.infra_records["secrets"]: Refreshing state... [id=fd7459cadcd7cc6b278b3cf48a0b1398]
cloudflare_record.infra_records["signoz"]: Refreshing state... [id=5b90434833452b7d428d61c7d33c1263]
null_resource.kubeconfig: Refreshing state... [id=7352832925648048633]
cloudflare_record.wildcard_internal[0]: Refreshing state... [id=d2abf7cd2683a09c2158d35e009219f7]
kubernetes_cluster_role_binding.atlantis_cluster_admin: Refreshing state... [id=atlantis-cluster-admin]
kubernetes_namespace.bootstrap: Refreshing state... [id=bootstrap]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_namespace.platform: Refreshing state... [id=platform]
kubernetes_storage_class.local_path_retain: Refreshing state... [id=local-path-retain]
kubectl_manifest.traefik_config: Refreshing state... [id=/apis/helm.cattle.io/v1/namespaces/kube-system/helmchartconfigs/traefik]
kubernetes_config_map_v1.local_path_config: Refreshing state... [id=kube-system/local-path-config]
data.local_file.kubeconfig: Reading...
data.local_file.kubeconfig: Read complete after 0s [id=e8e9d6301d5e9261409aef623945966463087ba8]
kubernetes_secret.cloudflare_api_token: Refreshing state... [id=cert-manager/cloudflare-api-token-secret]
helm_release.cert_manager: Refreshing state... [id=cert-manager]
kubectl_manifest.local_path_provisioner_restart: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/deployments/local-path-provisioner]
kubectl_manifest.cluster_issuer_letsencrypt_prod: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-prod]
kubectl_manifest.wildcard_certificate_public: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/cert-manager/certificates/wildcard-tls-public]
kubectl_manifest.wildcard_certificate_internal: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/cert-manager/certificates/wildcard-tls-internal]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.dns_a_record_set.digger will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "dns_a_record_set" "digger" {
      + addrs = (known after apply)
      + host  = "digger.zitian.party"
      + id    = (known after apply)
    }

  # cloudflare_record.infra_records["auth"] will be created
  + resource "cloudflare_record" "infra_records" {
      + allow_overwrite = true
      + content         = "103.214.23.41"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "auth"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "6e69310ba4000e47c0a2480e2606713a"
    }

  # cloudflare_record.infra_records["digger"] will be created
  + resource "cloudflare_record" "infra_records" {
      + allow_overwrite = true
      + content         = "103.214.23.41"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "digger"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "6e69310ba4000e47c0a2480e2606713a"
    }

  # helm_release.cnpg_operator will be created
  + resource "helm_release" "cnpg_operator" {
      + atomic                     = false
      + chart                      = "cloudnative-pg"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cnpg"
      + namespace                  = "cnpg-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://cloudnative-pg.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "monitoring":
                  "podMonitorEnabled": false
            EOT,
        ]
      + verify                     = false
      + version                    = "0.22.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.digger will be created
  + resource "helm_release" "digger" {
      + atomic                     = false
      + chart                      = "digger-backend"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "digger"
      + namespace                  = "bootstrap"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://diggerhq.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.platform_pg will be created
  + resource "kubectl_manifest" "platform_pg" {
      + api_version             = "postgresql.cnpg.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Cluster"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "platform-pg"
      + namespace               = "platform"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: postgresql.cnpg.io/v1
            kind: Cluster
            metadata:
              labels:
                layer: Platform
              name: platform-pg
              namespace: platform
            spec:
              bootstrap:
                initdb:
                  database: vault
                  owner: postgres
                  postInitSQL:
                  - CREATE DATABASE casdoor;
                  - CREATE DATABASE digger;
                  - CREATE TABLE IF NOT EXISTS vault_kv_store (parent_path TEXT COLLATE "C" NOT
                    NULL, path TEXT COLLATE "C", key TEXT COLLATE "C", value BYTEA, CONSTRAINT
                    pkey PRIMARY KEY (path, key));
                  - CREATE INDEX IF NOT EXISTS parent_path_idx ON vault_kv_store (parent_path);
                  - CREATE TABLE IF NOT EXISTS vault_ha_locks (ha_key TEXT COLLATE "C" NOT NULL,
                    ha_identity TEXT COLLATE "C" NOT NULL, ha_value TEXT COLLATE "C", valid_until
                    TIMESTAMP WITH TIME ZONE NOT NULL, CONSTRAINT ha_key PRIMARY KEY (ha_key));
              instances: 1
              monitoring:
                enablePodMonitor: false
              postgresql:
                parameters:
                  effective_cache_size: 256MB
                  max_connections: "100"
                  shared_buffers: 128MB
                  wal_level: replica
              resources:
                limits:
                  cpu: 500m
                  memory: 512Mi
                requests:
                  cpu: 100m
                  memory: 128Mi
              storage:
                size: 10Gi
                storageClass: local-path-retain
              superuserSecret:
                name: platform-pg-superuser
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.platform_pg_init will be destroyed
  # (because kubectl_manifest.platform_pg_init is not in configuration)
  - resource "kubectl_manifest" "platform_pg_init" {
      - api_version             = "batch/v1" -> null
      - apply_only              = false -> null
      - field_manager           = "kubectl" -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/batch/v1/namespaces/platform/jobs/platform-pg-init-a3a04d06" -> null
      - kind                    = "Job" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "1ecedd05-e572-4515-a5fa-b81910653354" -> null
      - name                    = "platform-pg-init-a3a04d06" -> null
      - namespace               = "platform" -> null
      - server_side_apply       = false -> null
      - uid                     = "1ecedd05-e572-4515-a5fa-b81910653354" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: batch/v1
            kind: Job
            metadata:
              name: platform-pg-init-a3a04d06
              namespace: platform
            spec:
              backoffLimit: 3
              template:
                metadata:
                  labels:
                    app: platform-pg-init
                spec:
                  containers:
                  - args:
                    - |2
                          #!/bin/sh
                          set -eu
            
                          for i in $(seq 1 30); do
                            if pg_isready -h "${PGHOST}" -U "${PGUSER}" >/dev/null 2>&1; then
                              break
                            fi
                            sleep 2
                          done
            
                          if ! pg_isready -h "${PGHOST}" -U "${PGUSER}" >/dev/null 2>&1; then
                            echo "PostgreSQL not ready after waiting." >&2
                            exit 1
                          fi
            
                          # Idempotent: create Casdoor database if missing
                          psql -h "${PGHOST}" -U "${PGUSER}" -tc "SELECT 1 FROM pg_database WHERE datname = 'casdoor'" | grep -q 1 || \
                            psql -h "${PGHOST}" -U "${PGUSER}" -c "CREATE DATABASE casdoor"
            
                          # Idempotent: create Vault tables if missing
                          psql -h "${PGHOST}" -U "${PGUSER}" -d vault <<'SQL'
                            CREATE TABLE IF NOT EXISTS vault_kv_store (
                              parent_path TEXT COLLATE "C" NOT NULL,
                              path        TEXT COLLATE "C",
                              key         TEXT COLLATE "C",
                              value       BYTEA,
                              CONSTRAINT pkey PRIMARY KEY (path, key)
                            );
                            CREATE INDEX IF NOT EXISTS parent_path_idx ON vault_kv_store (parent_path);
            
                            CREATE TABLE IF NOT EXISTS vault_ha_locks (
                              ha_key      TEXT COLLATE "C" NOT NULL,
                              ha_identity TEXT COLLATE "C" NOT NULL,
                              ha_value    TEXT COLLATE "C",
                              valid_until TIMESTAMP WITH TIME ZONE NOT NULL,
                              CONSTRAINT ha_key PRIMARY KEY (ha_key)
                            );
            
                            SELECT tablename FROM pg_tables WHERE schemaname = 'public' AND tablename LIKE 'vault_%';
                      SQL
                    command:
                    - /bin/sh
                    - -c
                    env:
                    - name: PGPASSWORD
                      value: Ld63FK25alvAwewa18YS85JMPwxzkt
                    - name: PGHOST
                      value: postgresql.platform.svc.cluster.local
                    - name: PGUSER
                      value: postgres
                    - name: PGPORT
                      value: "5432"
                    image: postgres:16
                    name: psql
                  restartPolicy: OnFailure
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubernetes_cluster_role_binding.atlantis_cluster_admin will be destroyed
  # (because kubernetes_cluster_role_binding.atlantis_cluster_admin is not in configuration)
  - resource "kubernetes_cluster_role_binding" "atlantis_cluster_admin" {
      - id = "atlantis-cluster-admin" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "atlantis-cluster-admin" -> null
          - resource_version = "257605" -> null
          - uid              = "e43f3e24-28ab-4edf-a679-df99544c3333" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "cluster-admin" -> null
        }

      - subject {
          - kind      = "ServiceAccount" -> null
          - name      = "atlantis" -> null
          - namespace = "bootstrap" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # kubernetes_config_map_v1.local_path_config will be updated in-place
  ~ resource "kubernetes_config_map_v1" "local_path_config" {
      ~ data        = {
          ~ "config.json"    = jsonencode(
              ~ {
                  ~ nodePathMap = [
                      ~ {
                          ~ paths = [
                              ~ "/var/lib/rancher/k3s/storage" -> "/data/local-path-provisioner",
                            ]
                            # (1 unchanged attribute hidden)
                        },
                    ]
                }
            )
          ~ "helperPod.yaml" = <<-EOT
                apiVersion: v1
                kind: Pod
                metadata:
                  name: helper-pod
                spec:
                  containers:
                  - name: helper-pod
                    image: "rancher/mirrored-library-busybox:1.36.1"
                    imagePullPolicy: IfNotPresent
            EOT
          ~ "setup"          = <<-EOT
                #!/bin/sh
                set -eu
                mkdir -m 0777 -p "${VOL_DIR}"
                chmod 700 "${VOL_DIR}/.."
            EOT
          ~ "teardown"       = <<-EOT
                #!/bin/sh
                set -eu
                rm -rf "${VOL_DIR}"
            EOT
        }
        id          = "kube-system/local-path-config"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "objectset.rio.cattle.io/applied"         = "H4sIAAAAAAAA/4ySX2vbMBTFv4p2t0c7deb8Q7CHsLSsLG1Cl/VlAnMtybFq+0pYSkoJ+e5DCYFurNsepR/n6JyDDoDOPOreG0vAYT+EBBQGBH4Aaaky28GTP6GDIMYEkFV6jaG+QyeA/4iXJ3JhAriAxfXN/PtyU6znmy/FzeqhuF/dF8vbb5vrRQEJ1Lp1ul9bNXjBrgX+KgNn+6GgxpDibG2VoE4HjIF4fISw05yd5amL2DstT0haSMDrsHPA4f27q9LQla8FeR1YqneCukaZnqUdy6bTKUsdE/Dh8LhaFovbh6MAQbLurGLTLLsQSCBo7JV9pjc8+46lffWbExwTiAWAw+fTgnfoIIFLkbgsEtmAwVjy8WjLJy2D12HQGzuQGEKrB8ZemegByZvcPpPu0+2+AQ5N7l+R/TBhXw2pT3OlLP3TIu4KHForsU19sD1u9X+JvEMZlc2u1Kl/8UF3sX6LpW7/Wq1GXwOH4Syv8rGcjKuqlHk2GU2yvBrl1XA8y9RMTmb4UWGpRtH0l5AOQ52ePyic0R+jHH8GAAD//7kWEdfgAgAA" -> null
              - "objectset.rio.cattle.io/id"              = null
              - "objectset.rio.cattle.io/owner-gvk"       = "k3s.cattle.io/v1, Kind=Addon" -> null
              - "objectset.rio.cattle.io/owner-name"      = "local-storage" -> null
              - "objectset.rio.cattle.io/owner-namespace" = "kube-system" -> null
            }
          ~ labels           = {
              - "objectset.rio.cattle.io/hash" = "183f35c65ffbc3064603f43f1580d8c68a2dabd4" -> null
            }
            name             = "local-path-config"
            # (5 unchanged attributes hidden)
        }
    }

  # kubernetes_namespace.platform will be updated in-place
  ~ resource "kubernetes_namespace" "platform" {
        id                               = "platform"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "layer" = "L2" -> "Platform"
            }
            name             = "platform"
            # (5 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.platform_pg_superuser will be created
  + resource "kubernetes_secret" "platform_pg_superuser" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "platform-pg-superuser"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # local_sensitive_file.ssh_key will be created
  + resource "local_sensitive_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "/tmp/infra-k3s.id_rsa"
      + id                   = (known after apply)
    }

  # null_resource.atlantis_test will be destroyed
  # (because null_resource.atlantis_test is not in configuration)
  - resource "null_resource" "atlantis_test" {
      - id       = "8377427200789139531" -> null
      - triggers = {
          - "test_trigger" = "atlantis-bot-verification-v2"
        } -> null
    }

  # time_sleep.wait_for_atlantis_dns will be destroyed
  # (because time_sleep.wait_for_atlantis_dns is not in configuration)
  - resource "time_sleep" "wait_for_atlantis_dns" {
      - create_duration = "60s" -> null
      - id              = "2025-12-21T19:32:14Z" -> null
      - triggers        = {
          - "host"   = "atlantis.zitian.party"
          - "vps_ip" = "103.214.23.41"
        } -> null
    }

  # time_sleep.wait_for_atlantis_https will be destroyed
  # (because time_sleep.wait_for_atlantis_https is not in configuration)
  - resource "time_sleep" "wait_for_atlantis_https" {
      - create_duration = "120s" -> null
      - id              = "2025-12-21T19:33:18Z" -> null
      - triggers        = {
          - "atlantis_version" = "5.23.0"
          - "domain"           = "atlantis.zitian.party"
        } -> null
    }

  # time_sleep.wait_for_digger_dns will be created
  + resource "time_sleep" "wait_for_digger_dns" {
      + create_duration = "60s"
      + id              = (known after apply)
      + triggers        = {
          + "host"   = "digger.zitian.party"
          + "vps_ip" = "103.214.23.41"
        }
    }

  # time_sleep.wait_for_platform_pg will be created
  + resource "time_sleep" "wait_for_platform_pg" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

Plan: 9 to add, 2 to change, 5 to destroy.

Changes to Outputs:
  - atlantis_service    = "atlantis.bootstrap.svc.cluster.local:4141" -> null
  - bootstrap_namespace = "bootstrap" -> null
  + cnpg_operator_ready = true
  + digger_url          = "https://digger.zitian.party"
  + digger_webhook_url  = "https://digger.zitian.party/github-app-webhook"
  ~ platform_pg_host    = "postgresql.platform.svc.cluster.local" -> "platform-pg-rw.platform.svc.cluster.local"
  + platform_pg_ready   = true

Error: Resource postcondition failed

  on 2.digger.tf line 110, in resource "helm_release" "digger":
 110:       condition     = can(regex("^https://", self.values[0]))

Digger ingress must be configured with HTTPS.
```

> To apply: comment `/bootstrap apply`